In [48]:
import pandas as pd
import numpy as np
from tqdm import tqdm

In [61]:
address = pd.read_csv('addresses.csv')
data = pd.read_csv('source2.csv')
print(address.shape, data.shape)

(28434, 2) (49, 14)

In [63]:
address.head()

         address    school
0  1900 Aaron Dr  Mayfield
1  1910 Aaron Dr  Mayfield
2  1920 Aaron Dr  Mayfield
3  1925 Aaron Dr  Mayfield
4  1930 Aaron Dr  Mayfield

In [64]:
data.head()

,FirstName,LastName,StudentNumber,Gender,Status,SchoolCode,BuildingGrade,Flag1,AddressofresidenceStreet,AddressofresidenceStreet2,AddressofresidenceCity,AddressofresidenceState,AddressofresidenceZip,Building Name
0,John,Doe,1,F,A,MIAM,1,NaN,3103 Roslyn Dr,NaN,Lexington,KY,40502,NaN
1,John,Doe,2,M,A,MICR,5,NaN,603 Gideon Rd,NaN,Lexington,KY,40502,NaN
2,John,Doe,3,F,A,MIRP,1,NaN,604 15th Ave,NaN,Lexington,KY,40502,NaN
3,John,Doe,4,M,A,MICR,KG,NaN,6930 Mount Vernon St Apt 20,NaN,Lexington,KY,40502,NaN
4,John,Doe,5,F,A,MICR,KG,1.0,4761 Caprice Dr,NaN,Lexington,KY,40502,NaN

In [73]:
%%time

buildings = [np.NaN] * data.shape[0]
for i,row in address.iterrows():
    try:
        idxs = data[data['AddressofresidenceStreet'].str.contains(row['address'])].index.values.astype(int)
        for idx in idxs:
            buildings[idx] = row['school']
    except IndexError as err:
        pass

Wall time: 42.3 s

In [68]:
len(buildings)

49

In [74]:
data['Building Name'] = buildings
data[data['Building Name'].notnull()].shape

(41, 14)

In [75]:
data.head()

,FirstName,LastName,StudentNumber,Gender,Status,SchoolCode,BuildingGrade,Flag1,AddressofresidenceStreet,AddressofresidenceStreet2,AddressofresidenceCity,AddressofresidenceState,AddressofresidenceZip,Building Name
0,John,Doe,1,F,A,MIAM,1,NaN,3103 Roslyn Dr,NaN,Lexington,KY,40502,Amanda
1,John,Doe,2,M,A,MICR,5,NaN,603 Gideon Rd,NaN,Lexington,KY,40502,Creekview
2,John,Doe,3,F,A,MIRP,1,NaN,604 15th Ave,NaN,Lexington,KY,40502,NaN
3,John,Doe,4,M,A,MICR,KG,NaN,6930 Mount Vernon St Apt 20,NaN,Lexington,KY,40502,Creekview
4,John,Doe,5,F,A,MICR,KG,1.0,4761 Caprice Dr,NaN,Lexington,KY,40502,Creekview

In [77]:
data[data['StudentNumber'] == 47]

,FirstName,LastName,StudentNumber,Gender,Status,SchoolCode,BuildingGrade,Flag1,AddressofresidenceStreet,AddressofresidenceStreet2,AddressofresidenceCity,AddressofresidenceState,AddressofresidenceZip,Building Name
46,John,Doe,47,M,A,MIMR,4,NaN,4809 Longford Dr,NaN,Lexington,KY,40502,Miller Ridge

In [72]:
data[data['AddressofresidenceStreet'].str.contains('5007 Woodridge Dr')].index.values.astype(int)

array([44, 45])

In [71]:
buildings[46]

'Miller Ridge'